api/app/controllers/todos_controller.rb

  def create
      todo = user.todos.create(todo_params)
      if todo.valid?
          app_response(status: :created, data: todo)
        else
          app_response(status: :unprocessable_entity, data: todo.errors, message: todo.errors.full_messages.join(', '))
---
SELECT "todos".* FROM "todos"