api/app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "summary", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
      todo = user.todos.create(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 2]]
---
  def update
      todo = user.todos.find(params[:id]).update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 6]]
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def destroy
      user.todos.find(params[:id]).destroy