api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "stevo"], ["email", "stevekid705@gmail.com"], ["password_digest", "mnbvcxz"], ["created_at", "2023-03-23 22:10:00.814853"], ["updated_at", "2023-03-23 22:10:00.814853"]]
---
  def register
    user = User.new(register_params)
    if user.save